//az aks get-credentials

AzureActivity 
| where OperationNameValue contains "Microsoft.ContainerService/managedClusters/listClusterAdminCredential/action" 


AzureDiagnostics 
| where Category == "kube-audit" 
| extend logs=parse_json(log_s) 
| where logs.user.username == "masterclient"
