//This query shows if any new workbook is created in Microsoft Sentinel
AzureActivity 
| where Caller contains "<migrationperson mail>" //Give the migration person e-mail 
| where OperationNameValue contains "microsoft.insights/workbooks/write"  // workbook creation 
| summarize arg_max(TimeGenerated, *) by Resource //summarize by the resource
| extend WorkbookID=Resource  
| where ActivityStatus contains "Succeeded"
| where isnotempty(WorkbookID) 
| project TimeGenerated,Caller,WorkbookID, ActivityStatus
