CommonSecurityLog
| where DeviceVendor=="Fortinet"
| where DeviceEventCategory=="utm:ips"
| parse-kv AdditionalExtensions as (FTNTFGTeventtime:long,FTNTFGTtz:string,FTNTFGTlogid:long,FTNTFGTsubtype:string,FTNTFGTeventtype:string,FTNTFGTlevel:string,FTNTFGTvd:string,FTNTFGTseverity:string,FTNTFGTsrccountry:string,FTNTFGTdstcountry:string,FTNTFGTsrcintfrole:string,FTNTFGTdstintfrole:string,FTNTFGTpolicyid:int,FTNTFGTpoluuid:string,FTNTFGTpolicytype:string,FTNTFGTattack:string,FTNTFGTattackid:int,FTNTFGTprofile:string,FTNTFGTref:string,FTNTFGTincidentserialno:long,FTNTFGTcrscore:int,FTNTFGTcraction:int,FTNTFGTcrlevel:string) with (pair_delimiter = ";", kv_delimiter = "=", quote = "'", escape = "\\") 
// extend MessageID=FTNTFGTlogid%100000
| extend MessageID=DeviceEventClassID,CommunicationDirection=iff(CommunicationDirection==1,"Outgoing","Incoming"),EventTime=(unixtime_nanoseconds_todatetime(tolong(FTNTFGTeventtime))+8h),LogSeverity=FTNTFGTseverity, EventType=FTNTFGTeventtype
| project-away FTNTFGTlogid,FTNTFGTtz, FTNTFGTeventtime,FTNTFGTvd,FTNTFGTpoluuid,FTNTFGTpolicytype, AdditionalExtensions,DeviceExternalID,DeviceVersion,ExtID, Type,FTNTFGTdstintfrole,FTNTFGTsrcintfrole, FTNTFGTseverity,FTNTFGTeventtype,FTNTFGTpolicyid,DeviceEventClassID, TenantId, DeviceEventCategory, SimplifiedDeviceAction, Computer
| project-rename LogSubType=FTNTFGTsubtype, Level=FTNTFGTlevel, Incidentserialno=FTNTFGTincidentserialno, Ref=FTNTFGTref, Profile=FTNTFGTprofile, Attackid=FTNTFGTattackid, Attack=FTNTFGTattack, SourceCountry=FTNTFGTsrccountry, DestinationCountry=FTNTFGTdstcountry, ClientReputationScore=FTNTFGTcrscore, ThreatWaitAction=FTNTFGTcraction, ClientReputationLevel=FTNTFGTcrlevel 
| project-reorder TimeGenerated,EventTime, DeviceVendor,DeviceProduct, DeviceAction ,CommunicationDirection, Activity,EventType,Level, SourceIP, SourcePort, DestinationIP, DestinationPort, DestinationHostName, SourceCountry,DestinationCountry,Message,Attack, Attackid, MessageID, ApplicationProtocol, RequestURL,LogSubType, Protocol, ClientReputationLevel,ThreatWaitAction, ClientReputationScore,Ref,Incidentserialno,  DeviceOutboundInterface, DeviceInboundInterface, Profile
